Revit 2027 API
ExportDWGSettings.Create(Document, String, DWGExportOptions) Method
 Create a DWG export settings with default values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExportDWGSettings Create(
	Document document,
	string name,
	DWGExportOptions options
)
Public Shared Function Create (
	document As Document,
	name As String,
	options As DWGExportOptions
) As ExportDWGSettings
public:
static ExportDWGSettings^ Create(
	Document^ document,
	String^ name,
	DWGExportOptions^ options
)
static member Create :
        document : Document *
        name : string *
        options : DWGExportOptions -> ExportDWGSettings
Parameters
document Document
 Document where created settings is saved.
name String
 The name specified to this settings.
options DWGExportOptions
 Initialize settings by using values in DWGExportOptions.
Return Value
ExportDWGSettings
 The new DWG export settings instance.
Exceptions
Exception | Condition
ArgumentException |  ExistOrEmpty
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportDWGSettings Class
Create Overload
Autodesk.Revit.DB Namespace